app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 23 Feb 2012 19:59:46 UTC +00:00], ["updated_at", Thu, 23 Feb 2012 19:59:46 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 18], ["created_at", Mon, 27 Feb 2012 18:47:18 UTC +00:00], ["order_id", nil], ["product_id", 5], ["quantity", 1], ["updated_at", Mon, 27 Feb 2012 18:47:18 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-02-24 08:11:55.514160' WHERE "line_items"."id" = 5
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save